#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/kiIIer/kubernetes-ops-staging-5-route53-hostedzone/runs/run-CP787v29efMwQsYf

Waiting for the plan to start...

Terraform v1.8.4
on linux_amd64
Initializing plugins and modules...
module.route53-hostedzone.aws_route53_zone.this: Refreshing state... [id=Z04491511CQYFSSSZOU0S]
module.route53-hostedzone.aws_kms_key.this: Refreshing state... [id=45c31c3b-619c-404f-8a89-0184ce7397b6]
module.route53-hostedzone.aws_route53_key_signing_key.this: Refreshing state... [id=Z04491511CQYFSSSZOU0S,key]
module.route53-hostedzone.aws_route53_hosted_zone_dnssec.this: Refreshing state... [id=Z04491511CQYFSSSZOU0S]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.route53-hostedzone.aws_kms_key.this has been deleted
  - resource "aws_kms_key" "this" {
      - arn                                = "arn:aws:kms:us-east-1:533267183023:key/45c31c3b-619c-404f-8a89-0184ce7397b6" -> null
        id                                 = "45c31c3b-619c-404f-8a89-0184ce7397b6"
        tags                               = {
            "ops_env"              = "staging"
            "ops_managed_by"       = "terraform"
            "ops_owners"           = "devops"
            "ops_source_repo"      = "kubernetes-ops"
            "ops_source_repo_path" = "terraform-environments/aws/staging/5-route53-hostedzone"
        }
        # (14 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.route53-hostedzone.aws_kms_key.this will be created
  + resource "aws_kms_key" "this" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "ECC_NIST_P256"
      + deletion_window_in_days            = 7
      + description                        = (known after apply)
      + enable_key_rotation                = false
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "SIGN_VERIFY"
      + multi_region                       = (known after apply)
      + policy                             = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "kms:DescribeKey",
                          + "kms:GetPublicKey",
                          + "kms:Sign",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "dnssec-route53.amazonaws.com"
                        }
                      + Resource  = "*"
                      + Sid       = "Allow Route 53 DNSSEC Service"
                    },
                  + {
                      + Action    = "kms:CreateGrant"
                      + Condition = {
                          + Bool = {
                              + "kms:GrantIsForAWSResource" = "true"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "dnssec-route53.amazonaws.com"
                        }
                      + Resource  = "*"
                      + Sid       = "Allow Route 53 DNSSEC Service to CreateGrant"
                    },
                  + {
                      + Action    = "kms:*"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "*"
                        }
                      + Resource  = "*"
                      + Sid       = "IAM User Permissions"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + rotation_period_in_days            = (known after apply)
      + tags                               = {
          + "ops_env"              = "staging"
          + "ops_managed_by"       = "terraform"
          + "ops_owners"           = "devops"
          + "ops_source_repo"      = "kubernetes-ops"
          + "ops_source_repo_path" = "terraform-environments/aws/staging/5-route53-hostedzone"
        }
      + tags_all                           = {
          + "ops_env"              = "staging"
          + "ops_managed_by"       = "terraform"
          + "ops_owners"           = "devops"
          + "ops_source_repo"      = "kubernetes-ops"
          + "ops_source_repo_path" = "terraform-environments/aws/staging/5-route53-hostedzone"
        }
    }

  # module.route53-hostedzone.aws_route53_key_signing_key.this will be updated in-place
  ~ resource "aws_route53_key_signing_key" "this" {
        id                         = "Z04491511CQYFSSSZOU0S,key"
      ~ key_management_service_arn = "arn:aws:kms:us-east-1:533267183023:key/45c31c3b-619c-404f-8a89-0184ce7397b6" -> (known after apply)
        name                       = "key"
        # (12 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 0 to destroy.


```


</details>

*Pusher: @kiIIer, Action: `pull_request`*